PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
                  //idxLatency13 = CrssCor(Buffer1.bufMIC1, Buffer1.bufMIC3, AUDIO_OUT_BUFFER_SIZE/2); 
                  //idxLatency12 = CrssCor(Buffer1.bufMIC1, Buffer1.bufMIC2, AUDIO_OUT_BUFFER_SIZE/2);
		
                  idxLatency78 = CrssCor(Buffer1.bufMIC7, Buffer1.bufMIC8, AUDIO_OUT_BUFFER_SIZE);	
                  idxLatency14 = CrssCor(Buffer1.bufMIC1, Buffer1.bufMIC4, AUDIO_OUT_BUFFER_SIZE);
                  idxLatency25 = CrssCor(Buffer1.bufMIC2, Buffer1.bufMIC5, AUDIO_OUT_BUFFER_SIZE);
                  idxLatency63 = CrssCor(Buffer1.bufMIC6, Buffer1.bufMIC3, AUDIO_OUT_BUFFER_SIZE);



                  SumDelay(&Buffer1);
#endif
					break;
					
				case BUF3_PLAY:
#if MAIN_CRSCORR
					for (uint16_t i=0; i<(_MAX_SS/128);i++)
					{
						
						arm_rfft_q15(&RealFFT_Ins,(q15_t *)&buffer2[i*128],(q15_t *)&bufferFFT[i*256]);
						arm_rfft_q15(&RealFFT_Ins,(q15_t *)&buffer2_1[i*128],(q15_t *)&bufferFFT_1[i*256]);
					
						arm_add_q15((q15_t *)&bufferFFT[i*256],    (q15_t *)&bufferFFT_1[i*256],	(q15_t *)&bufferFFTSum[i*256],
									 2*128);
					
						//for (uint16_t j=0; j<256;j++)
						//{
					    //   bufferFFTSum[i*256+j]<<=6;
					    //}
					
						
						arm_rfft_q15(&RealIFFT_Ins,(q15_t *)&bufferFFTSum[i*256],(q15_t *)&bufferSum[i*128]);
					}

#elif MAIN_FFT
					/* Summing in Buffer2 */
                                        Delay_Sum_FFT(&Buffer2,&FacMic, (int16_t * )bufferSum, 512);
                                       //FFT_SUM((int16_t *)buffer2, (int16_t * )buffer2_1,fbuffer, 1024);

					
#else

					//idxLatency13 = CrssCor(Buffer2.bufMIC1, Buffer2.bufMIC3, AUDIO_OUT_BUFFER_SIZE/2); 
                    //idxLatency12 = CrssCor(Buffer2.bufMIC1, Buffer2.bufMIC2, AUDIO_OUT_BUFFER_SIZE/2);

					idxLatency78 = CrssCor(Buffer2.bufMIC7, Buffer2.bufMIC8, AUDIO_OUT_BUFFER_SIZE);
					idxLatency14 = CrssCor(Buffer2.bufMIC1, Buffer2.bufMIC4, AUDIO_OUT_BUFFER_SIZE);
					idxLatency25 = CrssCor(Buffer2.bufMIC2, Buffer2.bufMIC5, AUDIO_OUT_BUFFER_SIZE);
					idxLatency63 = CrssCor(Buffer2.bufMIC6, Buffer2.bufMIC3, AUDIO_OUT_BUFFER_SIZE);

                     SumDelay(&Buffer2);
#endif
					break;
					
				default:
					break;
               
			}

	       //HAL_GPIO_TogglePin(GPIOA, GPIO_PIN_15);
	  }
	  

}


inline static void Audio_Play_Out(void)
{
  /* wait for DMA transfert complete									*/
  /* This flag is set to 1 in callback function of DMA interrupt  */
  /* if player is finished for curent buffer */ 
  if (XferCplt == 1)
  {
       RESET_IDX
       XferCplt = 0; // clear DMA interrupt flag
/*-------------------------------------------------------------------------------------------------------------
			  
	Sequence  Record Data                     Processing Data                 Player Data
			  
	1-------  Buffer1                         Buffer2                          Buffer3
			  
	2-------  Buffer3                         Buffer1                           Buffer2		  
			  
	3-------  Buffer2                         Buffer3                           Buffer1 
 ---------------------------------------------------------------------------------------------------------------*/
    switch (buffer_switch)
    {
      case BUF1_PLAY:
        /* Play data from buffer1 */
	    Audio_MAL_Play(Command_index? (uint32_t)Buffer3.bufMIC1:(uint32_t)Buffer3.bufMIC2 , 4*AUDIO_OUT_BUFFER_SIZE);
		/* set flag for switch buffer */		  
        buffer_switch = BUF3_PLAY;

        break;
      case BUF2_PLAY:
        /* Play data from buffer2 */
	    Audio_MAL_Play(Command_index? (uint32_t)Buffer1.bufMIC1:(uint32_t)Buffer1.bufMIC2, 4*AUDIO_OUT_BUFFER_SIZE);
		/* set flag for switch buffer */
        buffer_switch = BUF1_PLAY;
        
        break;
      case BUF3_PLAY:
        /* Play data from buffer1 */
       Audio_MAL_Play(Command_index? (uint32_t)Buffer2.bufMIC1:(uint32_t)Buffer2.bufMIC2 ,4*AUDIO_OUT_BUFFER_SIZE);
        /* set flag for switch buffer */		  
        buffer_switch = BUF2_PLAY;

        break;
      default:
        break;
    }
			   
  }
}


/* Private functions ---------------------------------------------------------*/

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  /* Enable the CPU Cache */
  CPU_CACHE_Enable();
  
  /* STM32F7xx HAL library initialization:
       - Configure the Flash ART accelerator on ITCM interface
       - Configure the Systick to generate an interrupt each 1 msec
       - Set NVIC Group Priority to 4
       - Global MSP (MCU Support Package) initialization
     */   
  HAL_Init();
  
  /* Configure the system clock to 216 MHz */
  //Test_SystemClock_Config(); 
  SystemClock_Config();
  BSP_AUDIO_OUT_ClockConfig(AUDIO_FREQ, NULL);
  
  /* Initialize the SDRAM */
  BSP_SDRAM_Init();


  BSP_LED_Init(LED1);
  BSP_LED_Init(LED2);

  /* Button Initialization */
  ButtonInit();
  //BSP_PB_Init(BUTTON_KEY,BUTTON_MODE_EXTI);


  /* Initialize for Audio player with CS43L22 */
  
  /* Init TS module */
  //BSP_TS_Init(BSP_LCD_GetXSize(), BSP_LCD_GetYSize());

  /* Init Host Library */
  //USBH_Init(&hUSBHost, USBH_UserProcess, 0);

  /* Add Supported Class */
  //USBH_RegisterClass(&hUSBHost, USBH_MSC_CLASS);
  
  /* Start Host Process */
  //USBH_Start(&hUSBHost);

   DFT_Init();	

    /* ---------PA4: LCCKO-------------*/
    __GPIOA_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_4;
    GPIO_INS.Mode =GPIO_MODE_IT_RISING;
    GPIO_INS.Pull =GPIO_NOPULL;
    GPIO_INS.Speed =GPIO_SPEED_HIGH;
    HAL_GPIO_Init(GPIOA,&GPIO_INS);

    /* Enable and set Button EXTI Interrupt to the lowest priority */
    HAL_NVIC_SetPriority((IRQn_Type)EXTI4_IRQn, INTERRUPT_PRI_EXT_LRCK, 0);
    HAL_NVIC_EnableIRQ((IRQn_Type)EXTI4_IRQn);
    /*-----------------------*/

    /*---------PE3: POWER DOWN-----------------*/
    __GPIOE_CLK_ENABLE();
    GPIO_INS.Pin = GPIO_PIN_3;
    GPIO_INS.Mode = GPIO_MODE_OUTPUT_PP;
    GPIO_INS.Pull = GPIO_PULLUP;
    GPIO_INS.Speed = GPIO_SPEED_HIGH;

    HAL_GPIO_Init(GPIOE, &GPIO_INS);
  
    HAL_GPIO_WritePin(GPIOE, GPIO_PIN_3, GPIO_PIN_RESET);

    /*----------------------------------------*/

#if (DEBUG)  
		/* UART for debug */
		USART3_Init();
#endif



    /*----------------------------------------*/
    MX_I2C2_Init(); //for STA321MP
    STA321MP_Ini();
	BSP_LED_Toggle(LED1);
    /* Init Audio Application */
    AUDIO_InitApplication();
	BSP_LED_Toggle(LED2);
   

	
