PhanLeSon03/Mic_Array/Projects/STM32746G/Applications/Audio/Mic_Array/Src/main.c
}



#ifdef  USE_FULL_ASSERT
/**
  * @brief  Reports the name of the source file and the source line number
  *         where the assert_param error has occurred.
  * @param  file: pointer to the source file name
  * @param  line: assert_param error line source number
  * @retval None
  */
void assert_failed(uint8_t* file, uint32_t line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif

/**
  * @brief  CPU L1-Cache enable.
  * @param  None
  * @retval None
  */
static void CPU_CACHE_Enable(void)
{
  /* Enable I-Cache */
  SCB_EnableICache();

  /* Enable D-Cache */
  SCB_EnableDCache();
}


void HAL_I2C_MspInit(I2C_HandleTypeDef* hi2c)
{

  GPIO_InitTypeDef GPIO_InitStruct;
    
  if(hi2c->Instance==I2C1)
  {
	/* USER CODE BEGIN I2C1_MspInit 0 */

	/*##-1- Configure the I2C clock source. The clock is derived from the SYSCLK #*/
	//RCC_PeriphCLKInitStruct.PeriphClockSelection = RCC_PERIPHCLK_I2C1;
	//RCC_PeriphCLKInitStruct.I2c1ClockSelection = RCC_I2C1CLKSOURCE_PCLK1;
	//HAL_RCCEx_PeriphCLKConfig(&RCC_PeriphCLKInitStruct);

	/*##-2- Enable peripherals and GPIO Clocks #################################*/
	/* Enable GPIO TX/RX clock */
	__HAL_RCC_GPIOB_CLK_ENABLE();

	/**I2C1 GPIO Configuration	
	PB6	  ------> I2C1_SCL (PB6)
	PB7	  ------> I2C1_SDA (PB7) 
	*/
	GPIO_InitStruct.Pin = GPIO_PIN_6|GPIO_PIN_7;
	GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
	GPIO_InitStruct.Pull = GPIO_PULLUP;
	GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
	GPIO_InitStruct.Alternate = GPIO_AF4_I2C1;
	HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

	/* Peripheral clock enable */
	__HAL_RCC_I2C1_CLK_ENABLE();
	/* Peripheral interrupt init*/
	HAL_NVIC_SetPriority(I2C1_EV_IRQn, 3, 0);
	HAL_NVIC_EnableIRQ(I2C1_EV_IRQn);

  }
  else if(hi2c->Instance==I2C2)
  {
  /* USER CODE BEGIN I2C2_MspInit 0 */

  /* USER CODE END I2C2_MspInit 0 */
  
    /**I2C2 GPIO Configuration    
    PB10     ------> I2C2_SCL
    PB11     ------> I2C2_SDA 
    */
    __HAL_RCC_GPIOB_CLK_ENABLE();
    
    GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_OD;
    GPIO_InitStruct.Pull = GPIO_NOPULL;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF4_I2C2;
    HAL_GPIO_Init(GPIOB, &GPIO_InitStruct);

    /* Peripheral clock enable */
    __HAL_RCC_I2C2_CLK_ENABLE();
    /* Peripheral interrupt init*/
    //HAL_NVIC_SetPriority(I2C2_EV_IRQn, 3, 1);
    //HAL_NVIC_EnableIRQ(I2C2_EV_IRQn);
  }

}

/*---------------------------------------------------*/
/*   UART                                            */
/* UART4 init function */
void USART3_Init(void)
{

  huart3.Instance = USART3;
  huart3.Init.BaudRate = 115200;
  huart3.Init.WordLength = UART_WORDLENGTH_8B;
  huart3.Init.StopBits = UART_STOPBITS_1;
  huart3.Init.Parity = UART_PARITY_NONE;
  huart3.Init.Mode = UART_MODE_TX_RX;
  huart3.Init.HwFlowCtl = UART_HWCONTROL_NONE;
  huart3.Init.OverSampling = UART_OVERSAMPLING_16;
  huart3.Init.OneBitSampling = UART_ONEBIT_SAMPLING_DISABLED ;
  huart3.AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT;
  HAL_UART_Init(&huart3);

  //HAL_NVIC_SetPriority(USART3_IRQn, 1, 1);
  //HAL_NVIC_EnableIRQ(USART3_IRQn);

}


void HAL_UART_MspInit(UART_HandleTypeDef *huart)
{

  GPIO_InitTypeDef GPIO_InitStruct;
  if(huart->Instance==USART3)
  {


  /* USER CODE END UART4_MspInit 0 */
    /* Peripheral clock enable */
    __USART3_CLK_ENABLE();
    __GPIOC_CLK_ENABLE();
  
    /**UART4 GPIO Configuration    
    PC10     ------> USART3_TX
    PC11     ------> USART3_RX
    */
    GPIO_InitStruct.Pin = GPIO_PIN_10|GPIO_PIN_11;
    GPIO_InitStruct.Mode = GPIO_MODE_AF_PP;
    GPIO_InitStruct.Pull = GPIO_PULLUP;
    GPIO_InitStruct.Speed = GPIO_SPEED_HIGH;
    GPIO_InitStruct.Alternate = GPIO_AF7_USART3;
    HAL_GPIO_Init(GPIOC, &GPIO_InitStruct);

    /* NVIC for USART */
    HAL_NVIC_SetPriority(USART3_IRQn, 7, 1);
    HAL_NVIC_EnableIRQ(USART3_IRQn);

  }

}



void EXTI4_IRQHandler(void)
{
    /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_4) != RESET)
  {
    
     if (cntRisingEXTI==20)
     {
    	/*--------------Enable read PCM data --------------------*/   
        //flgDlyUpd = 1;  
        //__HAL_SPI_ENABLE_IT(&hspi5, (SPI_IT_RXNE| SPI_IT_ERR));
		//__HAL_UNLOCK(&hspi5);
        //__HAL_SPI_ENABLE(&hspi5);
		cntRisingEXTI=0;

		/*Disable external interrupt */
		HAL_NVIC_DisableIRQ((IRQn_Type)(EXTI4_IRQn));
		//HAL_GPIO_DeInit(GPIOB,GPIO_PIN_4);
     }
     else
     {
         cntRisingEXTI++;
		 //__HAL_SPI_DISABLE(&hspi5);
     }
     
      __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_4);

  }
}
              
void EXTI15_10_IRQHandler(void)
{

}

/* Events for Button Press */
void EXTI9_5_IRQHandler(void)
{

  /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_8) != RESET)
  {
	  btnSW2 = 1;
	  BSP_LED_Toggle(LED2);
	  __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_8);

  }


  /* EXTI line interrupt detected */
  if(__HAL_GPIO_EXTI_GET_IT(GPIO_PIN_9) != RESET)
  {
		btnSW1 = 1;
		Command_index^=0x01;
		BSP_LED_Toggle(LED1);

	   __HAL_GPIO_EXTI_CLEAR_IT(GPIO_PIN_9);
  }

}


void DFT_Init(void)
{
#if MAIN_CRSCORR
		arm_rfft_init_q15(&RealFFT_Ins,(uint32_t)128,(uint32_t)0,(uint32_t)1);
		arm_rfft_init_q15(&RealIFFT_Ins,(uint32_t)128,(uint32_t)1,(uint32_t)1);
#endif  
		/* Initialize the CFFT/CIFFT module */	
		arm_rfft_init_f32(&S1,&SS1, 512,  0, 1); 
		arm_rfft_init_f32(&S2,&SS2, 512,  0, 1); 
		arm_rfft_init_f32(&S3,&SS3, 512,  0, 1); 
		arm_rfft_init_f32(&S4,&SS4, 512,  0, 1);
		arm_rfft_init_f32(&IS,&ISS, 512,  1, 1);

		//arm_rfft_fast_init_f32(&S1, 512);
                //arm_rfft_fast_init_f32(&S2, 512);
		//arm_rfft_fast_init_f32(&S3, 512);
		//arm_rfft_fast_init_f32(&S4, 512);
		//arm_rfft_fast_init_f32(&IS, 512);
}


void SumDelay(Mic_Array_Data *BufferIn)
{
           //if (idxLatency12>idxLatency13)
           // {
           //     if (idxLatency13 > idxLatency14)
           //     {
           //         /* MIC2 --> MIC3 --> MIC4 */
           //     }
           //             else if (idxLatency14 > idxLatency12)
           //             {
           //        /* MIC4-->MIC2-->MIC3  */
           //            }
           //             else
           //             {
           //       /* MIC2-->MIC4-->MIC3  */
           //             }
           // }
           //else // idxLatency13>idxLatency12
           //     {
           //    if (idxLatency12 > idxLatency14)
           //    {
           //        //MIC3 --> MIC2 --> MIC4 
           //    }
           //        else if (idxLatency14 > idxLatency13)
           //        {
           //        //MIC4 --> MIC3 --> MIC2
           //        }
           //        else
           //        {
           //        //MIC3 --> MIC4 --> MIC2
	   //	   }
	   //}

	
	for(uint16_t i=0;i<AUDIO_OUT_BUFFER_SIZE;i++)
	{

		 if (i%2==0)
		 {
                    bufferSum[i] = (uint16_t)(BufferIn->bufMIC1[i]*FacMic.facMIC1 + 
                    BufferIn->bufMIC2[(((i-idxLatency12)>0)?(i-idxLatency12):0)]*FacMic.facMIC2 + 
                    BufferIn->bufMIC3[(((i-idxLatency13)>0)?(i-idxLatency13):0)]*FacMic.facMIC3 + 
                    BufferIn->bufMIC4[(((i-idxLatency14)>0)?(i-idxLatency14):0)]*FacMic.facMIC4); 		
		 }
		 else
		 {
                     bufferSum[i] = (uint16_t)(BufferIn->bufMIC3[i]);
		 }
	}
}


void ButtonInit(void)
{
    /* PI8: SW2 */
	/* PI9: SW1 */
	 /* ----------------------*/
	 __GPIOB_CLK_ENABLE();
	GPIO_INS.Pin = GPIO_PIN_8|GPIO_PIN_9;
	GPIO_INS.Mode =GPIO_MODE_IT_RISING;
	GPIO_INS.Pull =GPIO_NOPULL;
	GPIO_INS.Speed =GPIO_SPEED_HIGH;
	HAL_GPIO_Init(GPIOI,&GPIO_INS);
	
	/* Enable and set Button EXTI Interrupt to the lowest priority */
	HAL_NVIC_SetPriority((IRQn_Type)EXTI9_5_IRQn, 0x0F, 0x00);
	HAL_NVIC_EnableIRQ((IRQn_Type)EXTI9_5_IRQn);
	/*-----------------------*/

}


/* I2C2 init function */
void MX_I2C2_Init(void)
{
   __HAL_I2C_DISABLE(&hi2c2);
  hi2c2.Instance = I2C2;
  hi2c2.Init.Timing =0x00A0689A ;//I2C_TIMING  0x00303D5D 0x00A0689A
  hi2c2.Init.OwnAddress1 = 0;
  hi2c2.Init.AddressingMode = I2C_ADDRESSINGMODE_7BIT;
  hi2c2.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
  hi2c2.Init.OwnAddress2 = 0;
  hi2c2.Init.OwnAddress2Masks = I2C_OA2_NOMASK;
  hi2c2.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
  hi2c2.Init.NoStretchMode = I2C_NOSTRETCH_DISABLE;
  HAL_I2C_Init(&hi2c2);

    /**Configure Analogue filter 
    */
  //HAL_I2CEx_AnalogFilter_Config(&hi2c2, I2C_ANALOGFILTER_ENABLE);

}

 void HAL_I2S_TxCpltCallback(I2S_HandleTypeDef *hi2s)
{
	 //sop1hc if(AudioState == AUDIO_STATE_PLAY)
	 //if (BufferCtlPlayOut.state == BUFFER_OFFSET_HALF)
	 {
	   //BufferCtlPlayOut.state = BUFFER_OFFSET_FULL;
	   XferCplt=1;
	   Audio_Play_Out(); 

	   if (cntStrt<100) cntStrt++;
	 }
	 

}

/*****************************END OF FILE**************************************/
